tap 'caskroom/cask'

# font
brew 'freetype'
brew 'fontconfig'

# java
cask 'java'


# version control
brew 'git-flow'
brew 'meld'

# monitoring
brew 'monit'

# frontend
brew 'node'
brew 'npm'

# browser
brew 'chromedriver'
brew 'phantomjs'

# android
brew 'android-sdk'

# utils
brew 'curl'
brew 'tree'
brew 'wget'
brew 'zsh'
brew 'zsh-completions'

# server
brew 'tomcat'

# amazon
brew 's3cmd'

# python
brew 'python'
brew 'python3'
brew 'pypy'
brew 'pypy3'

# computer vision
brew 'opencv'

# search
brew 'elasticsearch'

# languages
brew 'lua'

# VMs
brew 'virtualbox'

# queue
brew 'rabbitmq'

# database
brew 'mongodb'
brew 'mysql'
brew 'postgresql'

# docs
brew 'gettext'
brew 'pdf-tools'

# other useful binaries
brew 'libxml2'
brew 'libyaml'
brew 'swig'
